app/views/invoices/index.html.erb

    <td><%= invoice.customer_id %></td>
    <td><%= invoice.customer.first_name %></td>
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = 1 LIMIT 1