app/controllers/invoice_items_controller.rb

SELECT "invoice_items".* FROM "invoice_items"
---
  def index
    @invoice_items = InvoiceItem.all

SELECT "invoice_items".* FROM "invoice_items" WHERE "invoice_items"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @invoice_item = InvoiceItem.find(params[:id])

SELECT "invoice_items".* FROM "invoice_items" WHERE "invoice_items"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @invoice_item = InvoiceItem.find(params[:id])

INSERT INTO "invoice_items" ("created_at", "description", "invoice_id", "item_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", 1], ["description", nil], ["invoice_id", nil], ["item_id", nil], ["name", nil], ["updated_at", 3]]
---
  def create
    @invoice_item = InvoiceItem.new(params[:invoice_item])

    respond_to do |format|
      if @invoice_item.save

SELECT "invoice_items".* FROM "invoice_items" WHERE "invoice_items"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "invoice_items" SET "invoice_id" = 1, "name" = '', "description" = '', "updated_at" = '2012-04-20 15:46:39.906250' WHERE "invoice_items"."id" = 1
---
  def update
    @invoice_item = InvoiceItem.find(params[:id])

    respond_to do |format|
      if @invoice_item.update_attributes(params[:invoice_item])

SELECT "invoice_items".* FROM "invoice_items" WHERE "invoice_items"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "invoice_items" WHERE "invoice_items"."id" = ?  [["id", 2]]
---
  def destroy
    @invoice_item = InvoiceItem.find(params[:id])
    @invoice_item.destroy