app/controllers/invoices_controller.rb

SELECT "invoices".* FROM "invoices"
---
  def index
    @invoices = Invoice.all

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @invoice = Invoice.find(params[:id])

INSERT INTO "customers" ("created_at", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 14 Apr 2012 01:52:03 UTC +00:00], ["first_name", nil], ["last_name", nil], ["updated_at", Sat, 14 Apr 2012 01:52:03 UTC +00:00]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" = 2 LIMIT 1
SELECT "invoice_items".* FROM "invoice_items" WHERE "invoice_items"."invoice_id" = 1
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT 1  [["id", "3"]]
---
  def new
    @invoice = Invoice.new
    @customer = @invoice.create_customer

    respond_to do |format|
      format.html # new.html.erb
      format.json { render json: @invoice }
    end
  end

  # GET /invoices/1/edit
  def edit
    @invoice = Invoice.find(params[:id])
    @invoice_items = InvoiceItem.find(:all) #:conditions => { :invoice_id => @invoice.id } )

INSERT INTO "invoices" ("created_at", "customer_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 14 Apr 2012 01:52:11 UTC +00:00], ["customer_id", 1], ["updated_at", Sat, 14 Apr 2012 01:52:11 UTC +00:00]]
---
  def create
    @invoice = Invoice.new(params[:invoice])

    respond_to do |format|
      if @invoice.save

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT 1  [["id", "12"]]
DELETE FROM "invoices" WHERE "invoices"."id" = ?  [["id", 12]]
---
  def destroy
    @invoice = Invoice.find(params[:id])
    @invoice.destroy