app/controllers/items_controller.rb

INSERT INTO "items" ("UPC", "cost", "created_at", "description", "selling_price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["UPC", 123456789012], ["cost", 456], ["created_at", Mon, 30 Apr 2012 18:22:55 UTC +00:00], ["description", "Apple"], ["selling_price", 232], ["updated_at", Mon, 30 Apr 2012 18:22:55 UTC +00:00]]
---
  def create
    cost = params[:item][:cost]
    selling_price = params[:item][:selling_price]
    if cost == ""
      cost = "0"
    end
    if selling_price == ""
      selling_price = "0"
    end
    @item = Item.new(:cost => Money.new(Integer(cost)),:selling_price => Money.new(Integer(selling_price)))

    respond_to do |format|
      if @item.save